InformationRegisters/СопоставлениеРейтинговыхШкал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СопоставлениеРейтинговыхШкал</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеМинимальное</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияРейтингов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеМаксимальное</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияРейтингов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьШкалаРейтингаЭталонная</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШкалыРейтинговыхАгентств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборПоЭталоннойШкале</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаСопоставления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Агрегатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШкалы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыШкалРейтинговыхАгенств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СрокиРейтингов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РейтинговоеАгенство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РейтинговыеАгентства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРейтинга</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРейтингов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШкалаРейтингаЭталонная</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШкалыРейтинговыхАгентств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СопоставлениеРейтинговыхШкал/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура ШкалаРейтингаЭталоннаяПриИзменении(Элемент)
	ШкалаРейтингаЭталоннаяПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ШкалаРейтингаЭталоннаяПриИзмененииНаСервере()
	Запись.Агрегатор 	= Запись.ШкалаРейтингаЭталонная.Агрегатор;
	Запись.ТипШкалы 	= Запись.ШкалаРейтингаЭталонная.ТипШкалы;
	Запись.Срок 		= Запись.ШкалаРейтингаЭталонная.Срок;
	Запись.РейтинговоеАгенство = Запись.ШкалаРейтингаЭталонная.Владелец;
	Запись.ВидРейтинга 	= Запись.ШкалаРейтингаЭталонная.ВидРейтинга;
КонецПроцедуры
